{
  "backend/main.mo": "Motoko actor implementing a water bottle store backend with product CRUD operations and order placement/management, including stock validation and status updates.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (product catalog, checkout flow, admin dashboard, visual theme) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of one-line summaries for each frontend source file, describing purpose and key contents of every component, page, hook, and utility.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH CSS custom properties for light and dark color themes including background, primary, border, and chart tokens.",
  "frontend/index.html": "Minimal HTML shell titled 'Glass Bottle Water' that mounts the React app at the #root div and loads the main TSX entry point.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with three routes (/, /checkout, /admin) wrapped in AdminProvider, CartProvider, and a shared Layout.",
  "frontend/src/components/CartSummary.tsx": "Cart summary UI component that lists cart items with bottle thumbnails, quantity increment/decrement controls, line totals, and a grand total using the cart context.",
  "frontend/src/components/Layout.tsx": "App shell component providing a sticky header with logo, navigation links, admin mode toggle switch, mobile cart icon, and a responsive mobile nav bar.",
  "frontend/src/components/OrderManagement.tsx": "Admin component that displays a table of all orders with status badges and allows updating order status via a dropdown select. Uses `useListOrders` and `useUpdateOrderStatus` hooks.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product card with image, stock status badge, volume/price details, and an 'Add to Cart' button that is disabled when out of stock.",
  "frontend/src/components/ProductFormModal.tsx": "Modal dialog form for adding or editing a product, with validation and submission via `useAddProduct`/`useUpdateProduct` mutations.",
  "frontend/src/components/ProductManagement.tsx": "Admin component that lists all products in a table with edit and delete actions, and opens `ProductFormModal` for adding or editing products.",
  "frontend/src/context/AdminContext.tsx": "React context that tracks and toggles a boolean `isAdmin` state, exposing it via the `useAdmin` hook.",
  "frontend/src/context/CartContext.tsx": "React context managing shopping cart state (items, quantities, total price) with add, remove, update, and clear operations exposed via the `useCart` hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state and persisting identity via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for CRUD operations on products and orders, wrapping backend actor calls with caching and invalidation.",
  "frontend/src/index.css": "Global stylesheet defining a water-inspired design system with Tailwind, custom OKLCH CSS variables for light/dark themes, and utility classes for glass and gradient effects.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging (cn), price formatting, order ID generation, and nanosecond timestamp formatting.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabbed views for product and order management, gated behind an admin mode toggle.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that collects customer name and contact, submits an order via the placeOrder mutation, and displays a confirmation screen on success.",
  "frontend/src/pages/ProductCatalog.tsx": "Product catalog page with a hero banner, search input, availability filters, and a grid of product cards with cart integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining custom color palettes (water-themed, sidebar, chart), fonts (DM Sans, Plus Jakarta Sans), border radii, box shadows, and enabling dark mode, typography, container queries, and animation plugins.",
  "project_state.json": "Project state manifest tracking existing frontend features (product catalog, order flow, admin dashboard, visual theme, static assets) and pending backend feature requests (product catalog actor, order management system) for a packed drinking water glass bottle business app."
}